Былков_ДА_70180166/src/Documents/РекомендацииПоСтудентам/РекомендацииПоСтудентам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РекомендацииПоСтудентам</name>
  <basedOn>Document.ВедомостьУчетаАкадемическихЗадолженностей</basedOn>
  <basedOn>Document.ВедомостьУчетаАкадемическихЗадолженностейДляСтудентовсИОМ</basedOn>
  <attributes>
    <name>Студент</name>
    <type>
      <types>CatalogRef.Студенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Группа</name>
    <type>
      <types>CatalogRef.Группы</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормаОбучения</name>
    <type>
      <types>EnumRef.ФормаОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>Дисциплина</name>
    <type>
      <types>CatalogRef.Дисциплины</types>
    </type>
  </attributes>
  <attributes>
    <name>Рекомендация</name>
    <type>
      <types>EnumRef.РешениеКомиссии</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ВедомостьУчетаАкадемическихЗадолженностей</types>
      <types>DocumentRef.ВедомостьУчетаАкадемическихЗадолженностейДляСтудентовсИОМ</types>
      <types>DocumentRef</types>
    </type>
  </attributes>
</mdclass:Document>

Былков_ДА_70180166/src/Documents/РекомендацииПоСтудентам/ManagerModule.bsl
Процедура Печать(ТабДок, Ссылка) Экспорт
	
	Макет = Документы.РекомендацииПоСтудентам.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РекомендацииПоСтудентам.Группа,
	|	РекомендацииПоСтудентам.Дата,
	|	РекомендацииПоСтудентам.Дисциплина,
	|	РекомендацииПоСтудентам.ДокументОснование,
	|	РекомендацииПоСтудентам.Номер,
	|	РекомендацииПоСтудентам.Рекомендация,
	|	РекомендацииПоСтудентам.Студент,
	|	РекомендацииПоСтудентам.ФормаОбучения
	|ИЗ
	|	Документ.РекомендацииПоСтудентам КАК РекомендацииПоСтудентам
	|ГДЕ
	|	РекомендацииПоСтудентам.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	
КонецПроцедуры
